__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 180)          0                                            
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 180, 96)      4800096     input_1[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 180, 96)      0           embedding_1[0][0]                
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 174, 256)     172288      dropout_1[0][0]                  
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 177, 256)     98560       dropout_1[0][0]                  
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 180, 256)     24832       dropout_1[0][0]                  
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 178, 256)     73984       dropout_1[0][0]                  
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 179, 256)     49408       dropout_1[0][0]                  
__________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalM (None, 256)          0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
global_max_pooling1d_2 (GlobalM (None, 256)          0           conv1d_2[0][0]                   
__________________________________________________________________________________________________
global_max_pooling1d_3 (GlobalM (None, 256)          0           conv1d_3[0][0]                   
__________________________________________________________________________________________________
global_max_pooling1d_4 (GlobalM (None, 256)          0           conv1d_4[0][0]                   
__________________________________________________________________________________________________
global_max_pooling1d_5 (GlobalM (None, 256)          0           conv1d_5[0][0]                   
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 1280)         0           global_max_pooling1d_1[0][0]     
                                                                 global_max_pooling1d_2[0][0]     
                                                                 global_max_pooling1d_3[0][0]     
                                                                 global_max_pooling1d_4[0][0]     
                                                                 global_max_pooling1d_5[0][0]     
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 6)            7686        concatenate_1[0][0]              
==================================================================================================
Total params: 5,226,854
Trainable params: 5,226,854
Non-trainable params: 0
__________________________________________________________________________________________________
